<template>
    <div id='oldwork'>
        <div class="container">
            <h1 class="accent">Старые работы</h1>
            <div class="beginer"></div>
        </div>
        <div class="container">
            <spiner :imgArray="oldworks"></spiner>
            <center><br><br><p class="accent">Некоторые сайты могут уже быть не доступны</p></center>
        </div>
    </div>
</template>

<script>
    import spiner from '@/components/page_components/spiner'
    export default {
        name: "oldwork",
        components:{spiner},
        data(){
            return{
                oldworks: [
                    {
                        img: "/static/works/intech/th/index.jpg",
                        a: "ooointech.ru",
                        h3: "ООО Инновационные технологии",
                        p: "В лице директора компании ООО 'Инновационные технологии', выражаю свою благодарность за быструю, качественную, красивую добросовестную работу, выполненную в нужный срок.",
                        data: "13.02.2017",
                        content: "Этот корпоративный сайт компании занимающиеся запчастям на крановую и грузоподъемную технику. Для интернета доступна часть только информационная, но на сайте есть специально спроектированное приложение по работе с клиентами компании, а также приложения работы с почтой. Сайт также написан вручную без CMS (системы управления контентом)"
                    },
                    {
                        img: "/static/works/jobcam/th/index.jpg",
                        a: "",
                        h3: "JobCam.online",
                        p: "Быстро, анонимно, дешево и в срок",
                        data: "17.04.2016",
                        content: "Дизайнерский landing page (посадочная страница) или как принято сейчас называть лендинг, также созданны почтовые сообщения формата HTML. Создан для привлечения рабочей силы в штат компании. Сайт статичный и не адаптивный"
                    },
                    {
                        img: "/static/works/pktpk/th/index.jpg",
                        a: "",
                        h3: "ПК ТПК(Технологии Потребительских Коопераций)",
                        p: "Позетивно, очень быстро и практически даром",
                        data: "22.02.2016",
                        content: "Этот лендинг я сделал по крайне срочному заказу за 30 минут с поиском картинок и согласованием с заказчиком цветов, шрифтов и созданием логотипа"
                    },
                    {
                        img: "/static/works/aliance/th/index.jpg",
                        a: "aliance.company",
                        h3: "ООО Альянс",
                        p: "В лице директора компании ООО 'Альянс', выражаю свою благодарность за качественную, добросовестную работу.",
                        data: "25.11.2017",
                        content: "Сайт разработан по технологии mobile first (В первую очередь для мобильных устройств), написан в ручную без twitter bootstrap и без сторонних CMS (системы управления контентом). Данные по фирмам генерирует запрос из MySQL БД и подгружается по технологии AJAX с использованием JQuery."
                    },
                    {
                        img: "/static/works/fengshui-consultant/th/index.jpeg",
                        a: "fengshui-consultant.ru",
                        h3: "Феншуй для каждого",
                        p: "",
                        data: "",
                        content: "Этот частны сайт занимающийся консультациями по феншуй, на сайте планируется специально разработанные приложение для работы клиентов сайта. Сайт также написан вручную без CMS (системы управления контентом)"
                    },
                    {
                        img: "/static/works/taran/th/index.jpg",
                        a: "taran.com",
                        h3: "ИП Таран",
                        p: "Выражаю свою благодарность за качественную и добросовестную работу, выполненную в короткие сроки. с Вами приятно работать.",
                        data: "25.07.2016",
                        content: "Информационный сайт о деятельности предпринимателя созданный на платформе WIX поддерживаемый мной. В данный момент в связи с закрытием данного бизнеса сайт отключен"
                    },
                    {
                        img: "/static/works/trisestri/th/index.jpg",
                        a: "trisestri.ru",
                        h3: "Магазин тканей 'Три Сестры'",
                        p: "Все четко качественно и без задержек",
                        data: "20.01.2017",
                        content: "Интернет магазин созданный по заказу предпринимателя с системой управдения сайтом. Была использована сетка bootstrap, как следствие сайт можно использовать на мобильном устройстве. Но в связи с отсутствием интереса соучредителей компании, сайт отключен"
                    }

                ]
            }
        }
    }
</script>

<style scoped>

</style>